# 최소제곱해를 선형 행렬 방정식으로 얻기
import numpy as np
import matplotlib.pyplot as plt
import koreanize_matplotlib

x = np.array([0,1,2,3])
y = np.array([-1, 0.2, 0.5, 2.1])
# plt.scatter(x, y)
# plt.grid(True)
# plt.show()

A = np.vstack([x, np.ones(len(x))]).T
print(A)

# 본래 데이터를 직선으로 표현하기 위해 선형대수학 이용
import numpy.linalg as lin
# y = wx + b의 w, b 구하기
w, b = lin.lstsq(A, y)[0] #최소제곱법 연산 (내부적으로 편미분 사용) --------------------------- 중요!!!
print(w, ' ', b) # 기울기 : 0.95999999999, y절편 : -0.98999999

# 회귀식 y^ = 0.95999999999 * x - 0.98999999
print(0.95999999999 * 0 - 0.98999999) # 예측값 : -0.98999999 , 실제값 : -1
print(0.95999999999 * 1 - 0.98999999) # 예측값 : -0.029999990010000088 , 실제값 : -0.2
print(0.95999999999 * 2 - 0.98999999) # 예측값 : 0.9300000099799999 , 실제값 : 0.5
print(0.95999999999 * 3 - 0.98999999) # 예측값 : 1.8900000099699998 , 실제값 : 2.1

plt.scatter(x, y, label='실제값')
plt.plot(x, 0.95999999999 * x - 0.98999999, 'r', label='최적화된 선형 직선')
plt.grid(True)
plt.show()

# 경험하지 않은 x값에 대한 y값은?
x = 1.23456
y_h = 0.95999999999 * x - 0.98999999
print("예측결과 : ", y_h) # 0.19517760998765432

x2 = 7.654321
y_h = 0.95999999999 * x2 - 0.98999999
print("예측결과 : ", y_h) # 6.3581481699234565
